rottenpotatoes/app/controllers/movies_controller.rb

  def create
    @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("title", "director", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "blah"], ["director", "Blah"], ["created_at", "2015-12-15 02:27:37.027338"], ["updated_at", "2015-12-15 02:27:37.027338"]]

  def similar
    @movie = Movie.find(@id = params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]